; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	instrument2 - instrument
	spectrograph3 - mode
	spectrograph4 - mode
	thermograph2 - mode
	infrared1 - mode
	image0 - mode
	Star0 - direction
	Star4 - direction
	Star5 - direction
	GroundStation9 - direction
	Star10 - direction
	GroundStation11 - direction
	GroundStation7 - direction
	GroundStation6 - direction
	Star1 - direction
	GroundStation8 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet12 - direction
	Planet13 - direction
	Star14 - direction
	Star15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 infrared1)
	(supports instrument0 spectrograph3)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation2)
	(calibration_target instrument0 GroundStation7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation6)
	(supports instrument1 image0)
	(calibration_target instrument1 Star1)
	(calibration_target instrument1 GroundStation6)
	(supports instrument2 spectrograph4)
	(supports instrument2 thermograph2)
	(supports instrument2 infrared1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 GroundStation8)
	(on_board instrument1 satellite1)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation6)
)
(:goal (and
	(have_image Planet12 thermograph2)
	(have_image Planet13 spectrograph4)
	(have_image Star14 thermograph2)
	(have_image Star15 spectrograph4)
	(have_image Phenomenon16 spectrograph4)
))

)

; plan
1. (turn_to satellite1 groundstation2 groundstation6)
   deleted: (pointing satellite1 groundstation6)
   added: (pointing satellite1 groundstation2)
   goals met: 0 of 5
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 5
3. (calibrate satellite1 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 0 of 5
4. (turn_to satellite1 planet12 groundstation2)
   deleted: (pointing satellite1 groundstation2)
   added: (pointing satellite1 planet12)
   goals met: 0 of 5
5. (take_image satellite1 planet12 instrument2 thermograph2)
   added: (have_image planet12 thermograph2)
   goals met: 1 of 5
6. (turn_to satellite1 phenomenon16 planet12)
   deleted: (pointing satellite1 planet12)
   added: (pointing satellite1 phenomenon16)
   goals met: 1 of 5
7. (take_image satellite1 phenomenon16 instrument2 spectrograph4)
   added: (have_image phenomenon16 spectrograph4)
   goals met: 2 of 5
8. (turn_to satellite1 planet13 phenomenon16)
   deleted: (pointing satellite1 phenomenon16)
   added: (pointing satellite1 planet13)
   goals met: 2 of 5
9. (take_image satellite1 planet13 instrument2 spectrograph4)
   added: (have_image planet13 spectrograph4)
   goals met: 3 of 5
10. (turn_to satellite1 star14 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 star14)
   goals met: 3 of 5
11. (take_image satellite1 star14 instrument2 thermograph2)
   added: (have_image star14 thermograph2)
   goals met: 4 of 5
12. (turn_to satellite1 star15 star14)
   deleted: (pointing satellite1 star14)
   added: (pointing satellite1 star15)
   goals met: 4 of 5
13. (take_image satellite1 star15 instrument2 spectrograph4)
   added: (have_image star15 spectrograph4)
   goals met: 5 of 5
